Tekla.Structures.Plugins.PluginSymbolVisiblityAttribute
The PluginSymbolVisiblityAttribute class is used for defining the symbol visibility for model plug-ins.
The attribute is initialized from the custom attribute [PluginSymbolVisiblity(PluginBase.SymbolVisibility Type)] in the plug-in source.
If attribute is not defined or attribute has value PluginBase.SymbolVisibility.DRAW_SYMBOL plug-in symbol is drawn normally.

Tekla.Structures.Plugins.PluginSymbolVisiblityAttribute.#ctor(Tekla.Structures.Plugins.PluginBase.SymbolVisibility)
The custom attribute used to define coordinate system of the plug-in.
This is not to be used by itself.
Type: The type of the input object dependency.

Tekla.Structures.Plugins.PluginSymbolVisiblityAttribute.Type
Returns the type of the input object dependency.

Tekla.Structures.Plugins.PluginSymbolVisiblityAttribute.#ctor(System.Int32)
The custom attribute used to define coordinate system of the plug-in.
This is not to be used by itself.
Type: The type of the input object dependency as an integer.